Revit 2024 API
DuctFittingAndAccessoryData.Origin Property
 The origin position of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ Origin { get; }
Visual Basic
Public ReadOnly Property Origin As XYZ
	Get
Visual C++
public:
property XYZ^ Origin {
	XYZ^ get ();
}
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace